app/controllers/api/v1/users/registrations_controller.rb

      def exists
        email = params[:email]
        if email.blank?
          render json: { error: 'Email is required' }, status: :bad_request
        else
          exists = User.exists?(email: email)
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]

      def create
        # Check if the email already exists in the database
        if User.exists?(email: sign_up_params[:email])
          render json: { error: 'Email already exists' }, status: :unprocessable_entity
          return
        end

        user = User.new(sign_up_params)

        if user.save
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "role", "auth_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"