app/controllers/api/v1/users/sessions_controller.rb

      def create
        # Log incoming parameters for debugging
        Rails.logger.debug("Params received: #{params.inspect}")

        # Find the user by email
        user = User.find_by(email: sign_in_params[:email])

        if user.nil?
          render json: { error: 'Email not found.' }, status: :not_found
          return
        end

        if user.valid_password?(sign_in_params[:password])
          user.update(auth_token: SecureRandom.hex(20)) # Generate and update the token
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "auth_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2024-12-07 17:46:19.232500"], ["auth_token", "[FILTERED]"], ["id", 2]]