app/controllers/api/v1/enquiries_controller.rb

INSERT INTO "enquiries" ("name", "surname", "phonenumber", "email", "gender", "dob", "marital_status", "residential_address", "entry_date", "passport_number", "reference_number", "service_type", "elaborate", "immigration_status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    enquiry = current_user.enquiries.build(enquiry_params) # Associate enquiry with the logged-in user
    if enquiry.save

SELECT "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "[FILTERED]"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "enquiries".* FROM "enquiries" WHERE "enquiries"."user_id" = $1 LIMIT $2  [["user_id", 9], ["LIMIT", 10]]
---
  def show_by_id
    token = request.headers['Authorization']&.split(' ')&.last
    Rails.logger.info "Authorization Header: #{request.headers['Authorization']}"
    Rails.logger.info "Extracted Token: #{token}"

    @current_user = User.find_by(auth_token: token)
    Rails.logger.info "User Found: #{@current_user.inspect}"

    user = User.find_by(id: params[:id])
    Rails.logger.info "Target User: #{user.inspect}"

    if @current_user
      # Role-based access logic
      if @current_user.role == 'superadmin'
        # Superadmin can fetch all enquiries of any user
        enquiries = user&.enquiries
        render json: enquiries || { error: 'User not found' }, status: :ok
      elsif @current_user.role == 'admin'
        # Admin can view enquiries, but maybe only a subset (e.g., limited)
        enquiries = user&.enquiries&.limit(10)

SELECT "enquiries".* FROM "enquiries" WHERE "enquiries"."user_id" = $1 AND "enquiries"."id" = $2 LIMIT $3  [["user_id", 4], ["id", nil], ["LIMIT", 1]]
---
  def set_enquiry
    @enquiry = current_user.enquiries.find(params[:id]) # Ensure the enquiry belongs to the current user