app/controllers/enquiries_controller.rb

  def index
    @enquiries = Enquiry.all
---
SELECT "enquiries".* FROM "enquiries"